Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Having a single blob is easier to manage than many smaller files.
it_it: Avere un singolo blob è più facile da gestire rispetto a molti file più piccoli.

source: Header (like a title bar) is initially empty, and is a Flex-Flow container set up to flow its contained Widgets horizontally (:cpp:enumerator:`LV_FLEX_FLOW_ROW`), left to right.
it_it: L'Header (Intestazione) (come una barra del titolo) è inizialmente vuota ed è un contenitore Flex-Flow configurato per disporre i Widget in essa contenuti orizzontalmente (:cpp:enumerator:`LV_FLEX_FLOW_ROW`), da sinistra a destra.

source: Header mode
it_it: Modalità intestazione

source: Header on the background: :ref:`base_widget`
it_it: Intestazione sul background: :ref:`base_widget`

source: Headers
it_it: Intestazioni

source: Height in pixels (<= 2048)
it_it: Altezza in pixel (<= 2048)

source: Height is calculated automatically from the cell styles (font, padding etc) and the number of rows.
it_it: L'altezza viene calcolata automaticamente in base agli stili delle celle (carattere, spaziatura interna, ecc.) e al numero di righe.

source: Helpers
it_it: Helper

source: Here are some advantages of using LVGL in MicroPython:
it_it: Ecco alcuni vantaggi dell'utilizzo di LVGL in MicroPython:

source: Here are some advantages of using LVGL in NuttX
it_it: Ecco alcuni vantaggi dell'utilizzo di LVGL in NuttX

source: Here are some brief details on these core components.
it_it: Ecco alcuni brevi dettagli su questi componenti principali.

source: Here are some configurations that you can use to customize your NuttX and LVGL setup:
it_it: Ecco alcune configurazioni utilizzabili per personalizzare la configurazione di NuttX e LVGL:

source: Here are some examples of using LVGL that PikaScript can already run.
it_it: Ecco alcuni esempi di utilizzo di LVGL che PikaScript può già eseguire.

source: Here are some examples:
it_it: Ecco alcuni esempi:

source: Here are the changes, you can add them if you want." To do this you need a copy (called fork) of the original project under your account, make some changes there, and notify the original repository about your updates.
it_it: Ecco le modifiche, volendo, si possono aggiungere". Per fare ciò, c'è bisogno di una copia (chiamata fork) del progetto originale nel proprio account, apportare alcune modifiche e notificare al repository originale gli aggiornamenti.

source: Here are the functions that carry out this method of subscribing to a Subject.
it_it: Ecco le funzioni che eseguono questo metodo di sottoscrizione a un Subject.

source: Here are the guides to download and install |lvglpro| Editor appropriate for your platform:
it_it: Ecco le guide per scaricare e installare l'Editor |lvglpro| adatto piattaforma in uso:

source: Here are the requirements:
it_it: Compilare la documentazione è semplice.

source: Here are the steps to use the latest (or any) version of LVGL in NuttX.
it_it: Ecco i passaggi per utilizzare l'ultima versione (o qualsiasi) di LVGL in NuttX.

source: Here is a complete example:
it_it: Ecco un esempio completo:

source: Here is a generic example of the ``read_cb``:
it_it: Ecco un esempio generico di ``read_cb``:

source: Here is a list of some useful commands:
it_it: Ecco un elenco di alcuni comandi utili:

source: Here is a shortened example of what the output looks like.
it_it: Ecco un esempio abbreviato di come appare l'output.

source: Here is a simple example of using the NV3007 display with Arduino framework and SPI interface:
it_it: Ecco un semplice esempio di utilizzo del display NV3007 con il framework Arduino e l'interfaccia SPI:

source: Here is an example ``lv_draw_eve_target_parameters.h`` for the Riverdi RVT50HQBNWC00-B which has a BT817Q --- the EVE chip.
it_it: Ecco un esempio di ``lv_draw_eve_target_parameters.h`` per Riverdi RVT50HQBNWC00-B che ha un BT817Q --- ovvero il chip EVE.

source: Here is an example flush callback implementation.
it_it: Ecco un esempio di implementazione della funzione di callback del flush .

source: Here is an example implementation of a touch driver that uses i2c communication and an interrupt pin to signal available data.
it_it: Ecco un esempio di implementazione di un driver touch che utilizza la comunicazione I2C e un pin di interrupt per segnalare i dati disponibili.

source: Here is an example of a simple input-device read callback function:
it_it: Ecco un esempio di una semplice funzione di callback di lettura del dispositivo di input:

source: Here is an example of how to implement and set a rounder callback:
it_it: Ecco un esempio di come implementare e impostare una callback di arrotondamento:

source: Here is an example of setting the ``REG_TOUCH_CONFIG`` register on a BT817q EVE chip for a capacitive touch screen with a controller that has the i2c address ``0x15``.
it_it: Ecco un esempio di impostazione del registro ``REG_TOUCH_CONFIG`` su un chip EVE BT817q per un touch screen capacitivo con un controller con indirizzo I2C ``0x15``.

source: Here is an example that also shows some non-pixel units for sizes:
it_it: Ecco un esempio che mostra anche alcune unità di misura *non-pixel* per le dimensioni:

source: Here is an example that uses some of the functions above:
it_it: Ecco un esempio che utilizza alcune delle funzioni sopra descritte:

source: Here is an example to illustrate how to combine scroll event and store the scroll-top position.
it_it: Ecco un esempio per illustrare come combinare l'evento di scorrimento e memorizzare la posizione di scorrimento superiore.

source: Here is an example to see how to handle the event:
it_it: Ecco un esempio per vedere come gestire l'evento:

source: Here is an example:
it_it: Ecco un esempio:

source: Here is example to show bracket placement and use of white space:
it_it: Ecco un esempio per mostrare il posizionamento delle parentesi e l'uso degli spazi:

source: Here is how to build using the presets:
it_it: Ecco come compilare utilizzando i preset:

source: Here is how you can drive a RGB565 240x320 SPI display using STM32 HAL SPI.
it_it: Ecco come pilotare un display SPI RGB565 240x320 utilizzando STM32 HAL SPI.

source: Here is one recommended order of documents to read and things to play with while you are advancing your knowledge:
it_it: Ecco un ordine consigliato di documenti da leggere e di spunti su cui esercitarsi nell'approfondire le proprie conoscenze:

source: Here is the architecture of lvgl recipes folder:
it_it: Ecco l'architettura della cartella delle ricette lvgl:

source: Here is the execution output of the script
it_it: Ecco l'output di esecuzione dello script

source: Here is the minimum required content of the file.
it_it: Ecco il contenuto minimo richiesto del file.

source: Here we are using the :code:`native_posix` board, which allows for running the application on your posix compliant host system:
it_it: Qui utilizziamo la scheda :code:`native_posix`, che consente di eseguire l'applicazione sul sistema host compatibile con Posix:

source: Here you can:
it_it: Qui si può:

source: Here's a basic overview to help you navigate the portfolio.
it_it: Ecco una panoramica di base per aiutare a navigare nel portfolio.

source: Here's an example of getting LVGL to work with a custom format using the PNG decoder as an example.
it_it: Ecco un esempio di come far funzionare LVGL con un formato personalizzato utilizzando il decodificatore PNG.

source: Here's an example to define an "indicator" that can be added dynamically to a widget.
it_it: Ecco un esempio per definire un "indicatore" che può essere aggiunto dinamicamente a un widget.

source: Here's how it generally works:
it_it: Ecco come funziona in genere:

source: Here's how to create a basic GStreamer player and load media:
it_it: Ecco come creare un player GStreamer di base e caricare i contenuti multimediali:

source: Here's how to create a basic glTF viewer and load a model:
it_it: Ecco come creare un visualizzatore glTF di base e caricare un modello:

source: Here, the user can add custom code as needed.
it_it: Qui, l'utente può aggiungere codice personalizzato in base alle proprie esigenze.

source: Here’s how to set position and size directly:
it_it: Ecco come impostare posizione e dimensione direttamente:

source: Hide the cursor
it_it: Nascondere il cursore

source: Hiding the cursor
it_it: Nascondere il cursore

source: High Scalability.
it_it: Elevata scalabilità.

source: High-performance Linux display rendering with native DRM and OpenGL ES (EGL) support for embedded displays capable of rendering glTF models.
it_it: Rendering di display Linux ad alte prestazioni con supporto DRM nativo e OpenGL ES (EGL) per display embedded in grado di eseguire il rendering di modelli glTF.

source: Higher resolution values (256-512) provide better quality but use more memory
it_it: Valori di risoluzione più elevati (256-512) offrono una qualità migliore ma utilizzano più memoria

source: Highlight of QNX
it_it: Punti di forza di QNX

source: Highlighted days
it_it: Giorni evidenziati

source: Highlights of Berry
it_it: Punti di forza di Berry

source: Highlights of MicroPython
it_it: Punti di Forza di MicroPython

source: Highlights of NuttX
it_it: Punti di Forza di NuttX

source: Highlights of Zephyr
it_it: Punti di Forza di Zephyr

source: Hooks
it_it: Hook

source: Horizontal
it_it: Orizzontale

source: Horizontal and Vertical Gradients
it_it: Gradienti Orizzontali e Verticali

source: Horizontal and Vertical division lines
it_it: Linee di Divisione Orizzontali e Verticali

source: Horizontal offset.
it_it: Offset orizzontale.

source: Horizontal or Vertical Gradient
it_it: Gradiente Orizzontale o Verticale

source: Horizontal scaling (zoom) of the image.
it_it: Ridimensionamento orizzontale (zoom) dell'immagine.

source: Horizontal skew (parallelogram-like transformation) in 0.1-degree units (e.g., 456 means 45.6\ |deg|\ ).
it_it: Inclinazione orizzontale (trasformazione simile a un parallelogramma) in unità di 0,1 gradi (ad esempio, 456 significa 45,6 gradi).

source: Horizontal text offset.
it_it: Offset orizzontale del testo.

source: Hotkeys
it_it: Hotkey

source: How Can I Use It?
it_it: Come si Usa?

source: How Does It Work?
it_it: Come Funziona?

source: How It Works
it_it: Come Funziona

source: How Many Displays Can LVGL Use?
it_it: Quanti Display può Utilizzare LVGL?

source: How can I use it?
it_it: Come si usa?

source: How do I reduce RAM usage?
it_it: Come ridurre l'utilizzo di RAM?

source: How do I reduce flash/ROM usage?
it_it: Come posso ridurre l'utilizzo di flash/ROM?

source: How do I speed up my UI?
it_it: Come si può velocizzare l'interfaccia utente?

source: How do I use LVGL with an operating system?
it_it: Come si utilizza LVGL con un sistema operativo?

source: How it Works:
it_it: Come Funziona:

source: How to Use
it_it: Come si Usa

source: How to build this project using cmake
it_it: Come compilare questo progetto con cmake

source: How to get started with NuttX and LVGL?
it_it: Come iniziare con NuttX e LVGL?

source: How to run LVGL on QNX?
it_it: Come eseguire LVGL su QNX?

source: How to run LVGL on RT-Thread?
it_it: Come eseguire LVGL su RT-Thread?

source: How to run LVGL on Zephyr?
it_it: Come eseguire LVGL su Zephyr?

source: How-To Articles
it_it: Articoli Pratici

source: However there are three places where you can use LVGL's Drawing API directly.
it_it: Tuttavia, ci sono tre punti in cui è possibile utilizzare direttamente l'API di Disegno di LVGL.

source: However with the help of :cpp:func:`lv_display_set_flush_wait_cb` a custom wait callback be set for flushing.
it_it: Tuttavia, con l'aiuto di :cpp:func:`lv_display_set_flush_wait_cb`, è possibile impostare una callback di attesa personalizzata per il flush.

source: However, **Simulator Mode**:
it_it: Tuttavia, **Simulator Mode**:

source: However, LVGL documentation provides a work-around for this using reST Interpreted Text Roles.
it_it: Tuttavia, la documentazione LVGL fornisce una soluzione alternativa utilizzando gli Interpreted Text Roles.

source: However, a :ref:`lv_slider` has :cpp:enumerator:`LV_PART_MAIN`, :cpp:enumerator:`LV_PART_INDICATOR` and :cpp:enumerator:`LV_PART_KNOB`.
it_it: Tuttavia, uno :ref:`lv_slider` ha :cpp:enumerator:`LV_PART_MAIN`, :cpp:enumerator:`LV_PART_INDICATOR` e :cpp:enumerator:`LV_PART_KNOB`.

source: However, a common issue arises when the display is not powered on during the boot process.
it_it: Tuttavia, un problema comune si verifica quando il display non viene acceso durante il processo di avvio.

source: However, a timely dump of the Widget Tree right before that point will show that the Widget no longer exists.
it_it: Tuttavia, un dump tempestivo del Widget Tree subito prima di quel punto mostrerà che il Widget non esiste più.

source: However, as Widgets and Components work very differently (Widgets have C code, but Components are pure XML), even properties are interpreted differently.
it_it: Tuttavia, poiché Widget e Componenti funzionano in modo molto diverso (i Widget hanno codice C, mentre i Componenti sono XML puro), anche le proprietà vengono interpretate in modo diverso.

source: However, by setting :c:macro:`LV_LABEL_LONG_TXT_HINT` in ``lv_conf.h`` to a non-zero value, the performance with long text is significantly improved.
it_it: Tuttavia, impostando :c:macro:`LV_LABEL_LONG_TXT_HINT` in ``lv_conf.h`` su un valore diverso da zero, le prestazioni con il testo lungo migliorano significativamente.

source: However, by using :cpp:expr:`lv_refr_now(display)` you can tell LVGL to redraw the invalid areas immediately.
it_it: Tuttavia, utilizzando :cpp:expr:`lv_refr_now(display)` è possibile indicare a LVGL di ridisegnare immediatamente le aree non valide.

source: However, especially with small widgets, it can be helpful to make a widget's "clickable" area larger.
it_it: Tuttavia, soprattutto con i widget di piccole dimensioni, può essere utile ingrandire l'area "cliccabile" di un widget.

source: However, if :c:macro:`LV_TINY_TTF_FILE_SUPPORT` is enabled (i.e. ``1``), :cpp:expr:`lv_tiny_ttf_create_file(path, font_size)` will also be available, allowing tiny_ttf to stream from a file.
it_it: Tuttavia, se :c:macro:`LV_TINY_TTF_FILE_SUPPORT` è abilitato (ad esempio ``1``), sarà disponibile anche :cpp:expr:`lv_tiny_ttf_create_file(path, font_size)`, consentendo a tiny_ttf di eseguire lo streaming da un file.

source: However, if a Flush-Wait Callback is not set, LVGL assumes that :cpp:func:`lv_display_flush_ready` is called after the flush has completed.
it_it: Tuttavia, se una Callback Flush-Wait non è impostata, LVGL presume che :cpp:func:`lv_display_flush_ready` venga chiamata al termine del flush.

source: However, if all three sources are set, the width needs to be set by the user (using e.g. :cpp:expr:`lv_obj_set_width`) and the middle image will be tiled to fill the given size.
it_it: Tuttavia, se vengono impostate tutte e tre le sorgenti, la larghezza deve essere impostata dall'utente (ad esempio, utilizzando :cpp:expr:`lv_obj_set_width`) e l'immagine centrale verrà suddivisa in riquadri per riempire la dimensione specificata.

source: However, if it is available it can take a Draw Task.
it_it: Tuttavia, se è disponibile, può accettare una Draw Task.

source: However, if something new also needs to be drawn with ``lv_draw_rect/label/etc`` the current layer is also required.
it_it: Tuttavia, se è necessario disegnare qualcosa di nuovo con ``lv_draw_rect/label/etc``, è necessario anche il layer corrente.

source: However, if you are introducing your own Draw Unit(s), you will need to create and initialize it (after :cpp:func:`lv_init`) as above.
it_it: Tuttavia, se si introducono Draw Unit personalizzate, sarà necessario crearle e inizializzarle (dopo :cpp:func:`lv_init`) come sopra.

source: However, if you can open the image, a pointer to the decoded image should be set in ``dsc->decoded``.
it_it: Tuttavia, se è possibile aprire l'immagine, è necessario impostare un puntatore all'immagine decodificata in ``dsc->decoded``.

source: However, in LVGL, the base direction is not only applied to labels.
it_it: Tuttavia, in LVGL, la direzione di base non viene applicata solo alle "label" [etichette].

source: However, in order to use it for private repositories, a subscription is required.
it_it: Tuttavia, per utilizzarlo per i repository privati, è richiesto un abbonamento.

source: However, in some cases you might need more control on when display refreshing happens, for example:
it_it: Tuttavia, in alcuni casi potrebbe essere necessario un maggiore controllo su quando avviene l'aggiornamento del display, ad esempio:

source: However, in some cases, you might need more control over when to read the input device.
it_it: Tuttavia, in alcuni casi, potrebbe essere necessario un maggiore controllo su quando leggere il dispositivo di input.

source: However, it also results in higher memory consumption.
it_it: Tuttavia, comporta anche un maggiore consumo di memoria.

source: However, it can be made optional by setting a default value:
it_it: Tuttavia, può essere resa facoltativa impostando un valore di default:

source: However, it's about 30% slower to render compressed fonts.
it_it: Tuttavia, il rendering dei font compressi è circa il 30% più lento.

source: However, it's also possible to define custom properties in the ``<api>`` tag.
it_it: Tuttavia, è anche possibile definire proprietà personalizzate nel tag ``<api>``.

source: However, others need to be connected manually.
it_it: Tuttavia, altre devono essere collegate manualmente.

source: However, since the word "package" is used for the packaged output from the OpenEmbedded build system (i.e. ``.ipk`` or ``.deb`` files), this document avoids using the term "package" when referring to recipes.
it_it: Tuttavia, poiché il termine "package" viene utilizzato per l'output pacchettizzato dal sistema di build di OpenEmbedded (ad esempio, i file ``.ipk`` o ``.deb``), questo documento evita di utilizzare il termine "package" quando si fa riferimento alle ricette.

source: However, states can also be modified manually.
it_it: Tuttavia, gli stati possono anche essere modificati manualmente.

source: However, the *"Rectangle Mask Draw Task"* is useful when multiple areas need clearing or when the area to be masked differs from the layer area.
it_it: Tuttavia, il *"Task di Disegno di Maschera Rettangolare"* è utile quando è necessario pulire più aree o quando l'area da mascherare è diversa dall'area del layer.

source: However, the *Special events* are specific to a particular widget type.
it_it: Tuttavia, gli *Special event* sono specifici di un particolare tipo di widget.

source: However, the Arduino IDE does not provide a way to add custom compiler symbols through its interface.
it_it: Tuttavia, l'IDE di Arduino non fornisce un modo per aggiungere simboli di compilazione personalizzati tramite la sua interfaccia.

source: However, the Display Bus Interface specification includes a number of other, legacy interfaces, like SPI serial, or i8080-compatible parallel interface, which are often used to interface LCD displays to lower-end microcontrollers.
it_it: Tuttavia, la specifica Display Bus Interface include una serie di altre interfacce legacy, come l'interfaccia seriale SPI o l'interfaccia parallela compatibile con i8080, che vengono spesso utilizzate per interfacciare i display LCD con microcontrollori di fascia bassa.

source: However, the content of subsequent renderings will not be masked out in the corners.
it_it: Tuttavia, il contenuto dei rendering successivi non verrà mascherato negli angoli.

source: However, the drawing routine receives only simpler values.
it_it: Tuttavia, la routine di disegno riceve solo valori più semplici.

source: However, the most basic one is that pressed widgets will automatically have :cpp:enumerator:`LV_STATE_PRESSED`.
it_it: Tuttavia, la più elementare è che i widget premuti avranno automaticamente :cpp:enumerator:`LV_STATE_PRESSED`.

source: However, the number of Animations that can be playing at the same time is limited only by available RAM and CPU time for:
it_it: Tuttavia, il numero di animazioni che possono essere riprodotte contemporaneamente è limitato solo dalla RAM e dal tempo di CPU disponibili per:

source: However, the precedence of the states are still taken into account.
it_it: Tuttavia, la precedenza degli stati viene comunque presa in considerazione.

source: However, the result of each step can be queried:
it_it: Tuttavia, è possibile interrogare il risultato di ogni passo:

source: However, there are some limitations:
it_it: Tuttavia, ci sono alcune limitazioni:

source: However, there is still a way to do it through the ``./scripts/LVGLImage.py`` Python script.
it_it: Tuttavia, esiste ancora un modo per farlo tramite lo script Python ``./scripts/LVGLImage.py``.

source: However, they are easier to replace without needing to rebuild the main program.
it_it: Tuttavia, sono più facili da sostituire senza dover ricostruire il programma principale.

source: However, this approach has some drawbacks:
it_it: Tuttavia, questo approccio presenta alcuni svantaggi:

source: However, this can be done easily by calling ``lv_screen_load(screen1)``.
it_it: Tuttavia, questo può essere fatto facilmente chiamando ``lv_screen_load(screen1)``.

source: However, through experimentation, it has been found that a similar shadow effect can be achieved by using multiple layers of borders with different levels of transparency.
it_it: Tuttavia, attraverso la sperimentazione, si è scoperto che un effetto ombra simile può essere ottenuto utilizzando più layer di bordi con diversi livelli di trasparenza.

source: However, to keep LVGL's API leaner, less commonly used coordinate-related functions are only available via style properties.
it_it: Tuttavia, per mantenere l'API di LVGL più snella, le funzioni relative alle coordinate meno comunemente utilizzate sono disponibili solo tramite le proprietà di stile.

source: However, to make it easier to send a large number of parameters the generic MIPI driver supports sending a custom command list to the controller.
it_it: Tuttavia, per semplificare l'invio di un numero elevato di parametri, il driver MIPI generico supporta l'invio di un elenco di comandi personalizzati al controller.

source: However, when you use this option other dependencies can still be processed.
it_it: Tuttavia, utilizzando questa opzione, è comunque possibile elaborare altre dipendenze.

source: However, with :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ELASTIC` a fancy effect is added when the user "over-scrolls" the content.
it_it: Tuttavia, con :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ELASTIC` viene aggiunto un effetto particolare quando l'utente "scorre eccessivamente" il contenuto.

source: However, with transitions it's possible to play an animation on state change.
it_it: Tuttavia, con le transizioni è possibile riprodurre un'animazione al cambio di stato.

source: However, you can customize this behavior by providing a mode selection callback.
it_it: Tuttavia, è possibile personalizzare questo comportamento fornendo una callback per la selezione della modalità.

source: However, you can do something like this to accomplish the same thing:
it_it: Tuttavia, è possibile fare qualcosa di simile per ottenere lo stesso risultato:

source: I.e. ``START`` will mean right-most.
it_it: Ad esempio, ``START`` significherà "più a destra".

source: I.e. ``START`` will mean right.
it_it: Ad esempio, ``START`` significherà destra.

source: I.e. the Widget whose event handler is being called.
it_it: Ovvero il Widget il cui gestore eventi viene chiamato.

source: I.e., ``/home/you/app-release-exec-linux``.
it_it: Ovvero, ``/home/you/app-release-exec-linux``.
